parametric_campaign/cases/DOE_Case_01/0/epsilon
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 1e-04;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-04;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            epsilonLowReWallFunction;
        value           uniform 1e-04;
    }
    heat_sink_surfaces
    {
        type            epsilonLowReWallFunction;
        value           uniform 1e-04;
    }
    chip_bases
    {
        type            epsilonLowReWallFunction;
        value           uniform 1e-04;
    }
}
