parametric_campaign/cases/DOE_Case_01/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1.0;

vertices
(
    // Layer 0: z = 0.000 (Chassis bottom / Chip base)
    (0.000 -0.0700 0.000) // 0
    (0.000  0.0700 0.000) // 1
    (0.100 -0.0700 0.000) // 2
    (0.100  0.0700 0.000) // 3
    (0.180 -0.0700 0.000) // 4
    (0.180  0.0700 0.000) // 5
    (0.240 -0.0700 0.000) // 6
    (0.240  0.0700 0.000) // 7
    (0.320 -0.0700 0.000) // 8
    (0.320  0.0700 0.000) // 9
    (0.400 -0.0700 0.000) // 10
    (0.400  0.0700 0.000) // 11

    // Layer 1: z = 0.02500 (Fin tip plane)
    (0.000 -0.0700 0.02500) // 12
    (0.000  0.0700 0.02500) // 13
    (0.100 -0.0700 0.02500) // 14
    (0.100  0.0700 0.02500) // 15
    (0.180 -0.0700 0.02500) // 16
    (0.180  0.0700 0.02500) // 17
    (0.240 -0.0700 0.02500) // 18
    (0.240  0.0700 0.02500) // 19
    (0.320 -0.0700 0.02500) // 20
    (0.320  0.0700 0.02500) // 21
    (0.400 -0.0700 0.02500) // 22
    (0.400  0.0700 0.02500) // 23

    // Layer 2: z = 0.04445 (Top chassis wall)
    (0.000 -0.0700 0.04445) // 24
    (0.000  0.0700 0.04445) // 25
    (0.100 -0.0700 0.04445) // 26
    (0.100  0.0700 0.04445) // 27
    (0.180 -0.0700 0.04445) // 28
    (0.180  0.0700 0.04445) // 29
    (0.240 -0.0700 0.04445) // 30
    (0.240  0.0700 0.04445) // 31
    (0.320 -0.0700 0.04445) // 32
    (0.320  0.0700 0.04445) // 33
    (0.400 -0.0700 0.04445) // 34
    (0.400  0.0700 0.04445) // 35
);

blocks
(
    // Lower Fin Domain (Blocks 0-4)
    hex (0 2 3 1 12 14 15 13)       (20 32 20) simpleGrading (1 1 1)
    hex (2 4 5 3 14 16 17 15)       (24 32 20) simpleGrading (1 1 1)
    hex (4 6 7 5 16 18 19 17)       (16   32 20) simpleGrading (1 1 1)
    hex (6 8 9 7 18 20 21 19)       (24 32 20) simpleGrading (1 1 1)
    hex (8 10 11 9 20 22 23 21)     (20  32 20) simpleGrading (1 1 1)

    // Upper Bypass Domain (Blocks 5-9)
    hex (12 14 15 13 24 26 27 25)   (20 32 6) simpleGrading (1 1 1)
    hex (14 16 17 15 26 28 29 27)   (24 32 6) simpleGrading (1 1 1)
    hex (16 18 19 17 28 30 31 29)   (16   32 6) simpleGrading (1 1 1)
    hex (18 20 21 19 30 32 33 31)   (24 32 6) simpleGrading (1 1 1)
    hex (20 22 23 21 32 34 35 33)   (20  32 6) simpleGrading (1 1 1)
);

edges ();

defaultPatch
{
    name walls;
    type wall;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (12 13 25 24)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 22 23 11)
            (22 34 35 23)
        );
    }
    chip_bases
    {
        type wall;
        faces
        (
            (2 4 5 3)
            (6 8 9 7)
        );
    }
);
