parametric_campaign/cases/DOE_Case_01/system/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
numberOfSubdomains 16;
method          scotch;
